In [1]:
#Pair-programming Pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
#Ejercicio 1 - ¿Qué diferencia hay entre una Serie y un DataFrame?
#La serie es unidimensional y el dataframe es una estructura bidimensional

In [4]:
#Ejercicio 2 - Crea dos listas:
indices = ['Lunes','Martes','Miercoles','Jueves','Viernes','Sabado','Domingo']
valores=[]
for i in range (1,8):
    valores.append(i)
print(valores)
print(indices)

[1, 2, 3, 4, 5, 6, 7]
['Lunes', 'Martes', 'Miercoles', 'Jueves', 'Viernes', 'Sabado', 'Domingo']

In [5]:
serie1 = pd.Series(valores, indices)
serie1

Lunes        1
Martes       2
Miercoles    3
Jueves       4
Viernes      5
Sabado       6
Domingo      7
dtype: int64

In [6]:
diccionario1 = {}
for a,b  in zip(indices,valores):
    diccionario1[a]= b
print(diccionario1)

{'Lunes': 1, 'Martes': 2, 'Miercoles': 3, 'Jueves': 4, 'Viernes': 5, 'Sabado': 6, 'Domingo': 7}

In [7]:
serie_dicc = pd.Series(diccionario1)
serie_dicc

Lunes        1
Martes       2
Miercoles    3
Jueves       4
Viernes      5
Sabado       6
Domingo      7
dtype: int64

In [8]:
print(f"La forma de la Serie es: {serie_dicc.shape}")
print(f"El tipo de datos de la Serie es: {serie_dicc.dtype}")
print(f"El tamaño de la Serie es: {serie_dicc.size}")
print(f"Los indices de la Serie son: {serie_dicc.index}")
print(f"Los valores de la Serie son: {serie_dicc.values}")

La forma de la Serie es: (7,)
El tipo de datos de la Serie es: int64
El tamaño de la Serie es: 7
Los indices de la Serie son: Index(['Lunes', 'Martes', 'Miercoles', 'Jueves', 'Viernes', 'Sabado',
       'Domingo'],
      dtype='object')
Los valores de la Serie son: [1 2 3 4 5 6 7]

In [9]:
#Extrae el valor para el índice "lunes"
serie_dicc["Lunes"]

1

In [10]:
#Extrae el valor para el índice "lunes", "martes" y "miércoles".
serie_dicc["Lunes":"Miercoles"]

Lunes        1
Martes       2
Miercoles    3
dtype: int64

In [11]:
#Extrae el valor para el índice "lunes" y "domingo".
serie_dicc[["Lunes","Domingo"]]

Lunes      1
Domingo    7
dtype: int64

In [12]:
#Ejercicio3
#Crea un array de dos dimensiones con 4 filas y 3 columnas.
array_bidimensional = np.random.randint(1, 11, size=(4, 3))
array_bidimensional

array([[ 2,  6,  6],
       [ 7,  7,  1],
       [ 8, 10,  9],
       [ 6,  1,  4]])

In [13]:
#Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".
df_array_bi = pd.DataFrame(array_bidimensional, columns = ("España","Francia","Italia"))
df_array_bi

   España  Francia  Italia
0       2        6       6
1       7        7       1
2       8       10       9
3       6        1       4

In [14]:
#Descarga el archivo "medallas" y carga el DataFrame.

df_medallas = pd.read_csv("medallas.csv")
df_medallas

   Unnamed: 0             País   Oro  Plata  Bronce
0           1            China  1473    994     720
1           2            Japón  1032   1037     985
2           3    Corea del Sur   745    663     827
3           4             Irán   179    181     197
4           5       Kazajistán   155    158     224
5           6            India   154    202     315
6           7        Tailandia   132    175     278
7           8        Indonesia   112    131     240
8           9     China Taipéi    99    144     276
9          10  Corea del Norte    91    120     235

In [15]:
#Usando el loc extrae todas las columnas de la fila de Tailandia.
df_medallas.set_index("País", inplace=True)

In [16]:
#Usando el loc extrae todas las columnas de la fila de Tailandia.
df_medallas.loc["Tailandia",:]

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

In [17]:
#Usando el loc extrae todas las columnas de China e Irán.
df_medallas.loc[["China","Irán"],:]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

In [18]:
#Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.
df_medallas.loc[["China","Irán"],"Oro":"Bronce"]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

In [21]:
#Usando el iloc extrae la información de la India. Devolved todas las columnas.
df_medallas.iloc[5,:]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

In [38]:
#Usando el iloc extrae todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.
df_medallas.iloc[1::2,:]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

In [42]:
#Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".
df_medallas.iloc[1::2,1:4]

                  Oro  Plata  Bronce
País
Japón            1032   1037     985
Irán              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

In [ ]:
#Qué país consiguió más de 200 medallas de oro?